// Lab_03_4
// Лукашевич Андрій
// Лабораторна робота № 3.4
// Розгалуження, задане графіком функції
// Варіант 12

const x = +prompt('x = '); // Запрошуємо ввід значення х
const y = +prompt('y = '); // Запрошуємо ввід значення y
const R = +prompt('R = '); // Запрошуємо ввід значення вхідного параметру R

if ((x + R) ** 2 + (y - R) ** 2 >= R ** 2 && y <= R && x >= -R && y >= 0 && x <= 0 || (x - R) ** 2 + (y + R) ** 2 >= R ** 2 && y >= -R && x <= R && y <= 0 && x >= 0) {
  console.log('yes');
} else {
  console.log('no');
}
